Revit 2027 API
IFCImportOptions.GetConversionData Method
 Get the data used in the creation of the associated Revit file for an IFC link operation, if it exists.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkConversionData GetConversionData()
Public Function GetConversionData As LinkConversionData
public:
LinkConversionData^ GetConversionData()
member GetConversionData : unit -> LinkConversionData
Return Value
LinkConversionData
See Also
Reference
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace